# Завдання 6

# Написати програму визначення днів тижня. Дані про день тижня вводяться користувачем з клавіатури. Якщо будній день - виводити на екран повідомлення "Сьогодні на роботу", у вихідні дні - "Сьогодні вихідний", в інших випадках - "Такого дня не існує".

day = input("Введіть день тижня: ")

match day:
    case "понеділок" | "вівторок" | "середа" | "четвер" | "п'ятниця":
        print("Сьогодні на роботу")
    case "субота" | "неділя":
        print("Сьогодні вихідний")
    case _:
        print("Невірно введений день тижня")