# Завдання 3

# Напишіть програму, яка розв'язує квадратне рівняння 𝑎𝑥 2 + 𝑏𝑥 + 𝑐 = 0 у дійсних числах. На відміну від аналогічної вправи з минулого уроку, програма повинна видавати повідомлення про відсутність дійсних коренів, якщо значення дискримінанта 𝐷 = 𝑏 2 −4𝑎𝑐 негативне, єдине рішення 𝑥 = − 𝑏 / 2𝑎 , якщо він дорівнює нулю, або два корені 𝑥1,2 = −b±D−−√/2a
# , якщо він позитивний.

a, b, c = int(input()), int(input()), int(input())

D = b**2 - 4 * a * c

if D < 0:
    print("There aren't real roots")
elif D == 0:
    root = -b / (2*a)
    print(root)
else:
    root1 = -b + (D / (2 * a))**0,5
    root2 = -b - (D / (2 * a))**0,5
    print(f"root1 = {root1}, root2 = {root2}")
