# Завдання 8

# Створіть змінну name, age, в якій зберігатиметься ім'я та вік користувача, введене з клавіатури. Виведіть у консоль “My name is and I am ”, але зробіть рішення таким, щоб використовувалася конкатенація рядків (через +) та приведення типу числа до рядка (str(...)). Тобто, щоб якщо замінити змінні name і age, то в методі print() нічого не потрібно було би змінювати. Наприклад, a = 15, print(“Value =” + str(a)) і буде “Value = 15”.

name = input("name: ")
age = int(input("age: "))

print("My name is " + str(name) + " and I am " + str(age))