# Завдання 3

# Напишіть програму, яка розв'язує квадратне рівняння 𝑎𝑥2 + 𝑏𝑥 + 𝑐 = 0 за формулами 𝑥1,2 =  −𝑏± b2−4ac−−−−−−−√
#  / 2𝑎 . Значення a, b та c вводяться з клавіатури. Для знаходження кореня використовуйте оператор зведення в ступінь, а не функцію math.sqrt, щоб отримати комплексні числа у випадку, якщо вираз під коренем негативний. 


a = int(input("a = "))
b = int(input("b = "))
c = int(input("c = "))


print("result1 =", -b + ((b**2 - 4 * a * c)**0.5) / (2 * a))
print("result2 =", -b - ((b**2 - 4 * a * c)**0.5) / (2 * a))

