# Завдання 6

# Напишіть програму для аналізу фідбеку від відвідувачів курорту «Морська зірка», 
# яка повинна знаходити згадки про меню, спортзал, обслуговування(за кожне знайдене 
# співпадіння нараховується 5% знижки на наступне відвідування). Якщо фідбек 
# перевищив 60 символів, відвідувачу надається додаткова знижка 15% на наступне відвідування.

user_text = input("Enter your review: ")

discount_sum = 0

key_words = ["меню", "спортзал", "обслуговування"]

for word in key_words:
    if word in user_text:
        discount_sum += 5

if len(user_text) > 60:
    discount_sum += 15

print("All discount =", discount_sum)

